In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

# show start of df
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [2]:
# show end of df
school_data_complete.tail()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [3]:
school_data_complete.describe

<bound method NDFrame.describe of        Student ID       student_name gender grade         school_name  \
0               0       Paul Bradley      M   9th   Huang High School
1               1       Victor Smith      M  12th   Huang High School
2               2    Kevin Rodriguez      M  12th   Huang High School
3               3  Dr. Richard Scott      M  12th   Huang High School
4               4         Bonnie Ray      F   9th   Huang High School
...           ...                ...    ...   ...                 ...
39165       39165       Donna Howard      F  12th  Thomas High School
39166       39166          Dawn Bell      F  10th  Thomas High School
39167       39167     Rebecca Tanner      F   9th  Thomas High School
39168       39168       Desiree Kidd      F  10th  Thomas High School
39169       39169    Carolyn Jackson      F  11th  Thomas High School

       reading_score  math_score  School ID      type  size   budget
0                 66          79          0  District  2917  1910635
1                 94          61          0  District  2917  1910635
2                 90          60          0  District  2917  1910635
3                 67          58          0  District  2917  1910635
4                 97          84          0  District  2917  1910635
...              ...         ...        ...       ...   ...      ...
39165             99          90         14   Charter  1635  1043130
39166             95          70         14   Charter  1635  1043130
39167             73          84         14   Charter  1635  1043130
39168             99          90         14   Charter  1635  1043130
39169             95          75         14   Charter  1635  1043130

[39170 rows x 11 columns]>

In [4]:
# check for incomplete columns
count = school_data_complete.count()
count

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
School ID        39170
type             39170
size             39170
budget           39170
dtype: int64

In [5]:
# find count of schools
total_schools = len(school_data_complete["school_name"].unique())
total_schools

15

In [6]:
# find total count of students

total_students = school_data_complete["Student ID"].count()
total_students

39170

In [7]:
# find district budget
total_school_budget = sum(school_data_complete["budget"].unique())
total_school_budget

24649428

In [8]:
# find district average math score
average_math_score = '{:,.2f}'.format(school_data_complete["math_score"].mean())
average_math_score

'78.99'

In [9]:
# find district average reading score
average_reading_score = '{:,.2f}'.format(school_data_complete["reading_score"].mean())
average_reading_score

'81.88'

In [10]:
# find disrtict passing math percentage
passing_math = "{0:.2%}".format((len(school_data_complete[school_data_complete["math_score"] > 59]))/total_students)
passing_math

'92.45%'

In [11]:
# find district passing reading percentage
passing_reading = "{0:.2%}".format((len(school_data_complete[school_data_complete["reading_score"] > 59]))/total_students)
passing_reading

'100.00%'

In [ ]:
# need to convert float to int for table
#df['Passing Math'] = df['Passing Math'].replace("%","")
#df['Passing Reading'] = df['Passing Reading'].replace("%","")

In [18]:
# creat district summary table
#district_summary_df = pd.DataFrame({"Total Schools":total_schools,
 #                                   "Total Students":total_students,
  #                                  "Total Budget":total_school_budget,
   #                                 "Average Math Score":float(average_math_score),
    #                                "Average Reading Score":float(average_reading_score),
     #                               "Passing Math":float(passing_math),
      #                              "Passing Reading":float(passing_reading)})
                                    #"Overall Passing Rate"
#district_summary_df

In [19]:
# find overall average of math and reading percentages
    # overall_passing_rate = int(passing_math) + 1 
    # overall_passing_rate

In [20]:
#school_group_dftest = school_data_complete.groupby(["school_name","type"])
#school_group_dftest.head()

In [21]:
#school_group_df = school_data_complete.loc[school_data_complete["school_name"] == "Huang High School", :]
#school_group_df

In [22]:
# create and clean new summary datafram
school_data_summary = school_data.copy()
school_data_summary = school_data_summary.drop(columns={"School ID"})
school_data_summary = school_data_summary.rename(columns={"school_name":"School Name", "type":"Type", "size":"Size", "budget":"Budget"})
school_data_summary['Per Student Budget'] = ''
school_data_summary['Average Math Score'] = ''
school_data_summary['Average Reading Score'] = ''
school_data_summary['Passing Math'] = ''
school_data_summary['Passing Reading'] = ''
school_data_summary['Overall Passing Rate'] = ''
school_data_summary.head()

,School Name,Type,Size,Budget,Per Student Budget,Average Math Score,Average Reading Score,Passing Math,Passing Reading,Overall Passing Rate
0,Huang High School,District,2917,1910635,,,,,,
1,Figueroa High School,District,2949,1884411,,,,,,
2,Shelton High School,Charter,1761,1056600,,,,,,
3,Hernandez High School,District,4635,3022020,,,,,,
4,Griffin High School,Charter,1468,917500,,,,,,

In [23]:
# compile and format per student budget for each school
school_data_summary["Per Student Budget"] = school_data_summary["Budget"] / school_data_summary["Size"]
school_data_summary["Per Student Budget"] = school_data_summary["Per Student Budget"].map("${:,.2f}".format)
school_data_summary.head()

,School Name,Type,Size,Budget,Per Student Budget,Average Math Score,Average Reading Score,Passing Math,Passing Reading,Overall Passing Rate
0,Huang High School,District,2917,1910635,$655.00,,,,,
1,Figueroa High School,District,2949,1884411,$639.00,,,,,
2,Shelton High School,Charter,1761,1056600,$600.00,,,,,
3,Hernandez High School,District,4635,3022020,$652.00,,,,,
4,Griffin High School,Charter,1468,917500,$625.00,,,,,

In [24]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [25]:
# pull number of students in each school
student_counts = school_data_complete["school_name"].value_counts()
student_counts.head()

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Name: school_name, dtype: int64

In [26]:
# groupby math scores for each school
math_score = school_data_complete.groupby(['school_name'])['math_score'].sum()
math_score

school_name
Bailey High School       383393
Cabrera High School      154329
Figueroa High School     226223
Ford High School         211184
Griffin High School      122360
Hernandez High School    358238
Holden High School        35784
Huang High School        223528
Johnson High School      366942
Pena High School          80654
Rodriguez High School    307294
Shelton High School      146796
Thomas High School       136389
Wilson High School       190115
Wright High School       150628
Name: math_score, dtype: int64

In [27]:
# groupby reading scores for each school
reading_score = school_data_complete.groupby(['school_name'])['reading_score'].sum()
reading_score

school_name
Bailey High School       403225
Cabrera High School      156027
Figueroa High School     239335
Ford High School         221164
Griffin High School      123043
Hernandez High School    375131
Holden High School        35789
Huang High School        236810
Johnson High School      385481
Pena High School          80851
Rodriguez High School    322898
Shelton High School      147441
Thomas High School       137093
Wilson High School       191748
Wright High School       151119
Name: reading_score, dtype: int64

In [28]:
# create table to hold scores
score_table = pd.DataFrame({"Students in School": student_counts,
                            "Math Scores": math_score,
                            "Reading Scores": reading_score})
score_table.head()

                      Students in School  Math Scores  Reading Scores
Bailey High School                  4976       383393          403225
Cabrera High School                 1858       154329          156027
Figueroa High School                2949       226223          239335
Ford High School                    2739       211184          221164
Griffin High School                 1468       122360          123043

In [29]:
# create and calculating columns in table
score_table['Average Math Score'] = ""
score_table['Average Math Score'] = score_table["Math Scores"]/score_table["Students in School"]
score_table['Average Math Score'] = score_table['Average Math Score'].map("{:,.2f}".format)
score_table['Average Reading Score'] = ""
score_table['Average Reading Score'] = score_table["Reading Scores"]/score_table["Students in School"]
score_table['Average Reading Score'] = score_table['Average Reading Score'].map("{:,.2f}".format)
score_table

,Students in School,Math Scores,Reading Scores,Average Math Score,Average Reading Score
Bailey High School,4976,383393,403225,77.05,81.03
Cabrera High School,1858,154329,156027,83.06,83.98
Figueroa High School,2949,226223,239335,76.71,81.16
Ford High School,2739,211184,221164,77.10,80.75
Griffin High School,1468,122360,123043,83.35,83.82
Hernandez High School,4635,358238,375131,77.29,80.93
Holden High School,427,35784,35789,83.80,83.81
Huang High School,2917,223528,236810,76.63,81.18
Johnson High School,4761,366942,385481,77.07,80.97
Pena High School,962,80654,80851,83.84,84.04
Rodriguez High School,3999,307294,322898,76.84,80.74
Shelton High School,1761,146796,147441,83.36,83.73
Thomas High School,1635,136389,137093,83.42,83.85
Wilson High School,2283,190115,191748,83.27,83.99
Wright High School,1800,150628,151119,83.68,83.95

In [33]:
math_passing_score = school_data_complete[school_data_complete[(math_score > 70)]

SyntaxError: unexpected EOF while parsing (<ipython-input-33-5b565b318327>, line 1)

In [ ]:
math_score = school_data_complete.groupby(['school_name'])['math_score'].sum()
math_score